WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
/****************************************************************************
 * hcom_nx_config_manager.c
 *
 *   Copyright (C) 2021 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

//  The methods and data structures in this file provide access to the
//  configuration of the meadow board.
#include <nuttx/config.h>

#include <arpa/inet.h>
#include <ctype.h>
#include <strings.h>
#include <time.h>
#include <nuttx/semaphore.h>
#include <nuttx/kstring.h>

#include "hcom_nx_common.h"
#include <meadow/hcom_upd_shared.h>
#include <meadow/hcom_nuttx_shared.h>
#include <meadow/meadow_hw_version.h>
#include <meadow/meadow_os.h>
#include "../espcp/espcp_coprocessor.h"
#include "../espcp/espcp_message_dispatcher.h"
#include "../espcp/espcp_event_handlers.h"
#include "../espcp/espcp_shared_enums.h"
#include "../espcp/espcp_usrsock.h"
#include "../misc/meadow_logging.h"
#include "stm32_uid.h" // stm32_get_uniqueid()

#include "hcom_nx_common.h"

#include "hcom_nx_config_manager.h"
#include "hcom_nx_config_manager_yaml.h"

/****************************************************************************
 * Uncomment the #define below to turn on debug help macros.
 ****************************************************************************/
// #define USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/**
 *  @brief Default entry in the network_interfaces array to be used if no interface
 *         is selected in the config file.
 */
#define MEADOW_DEFAULT_NETWORK_INTERFACE    MEADOW_IFT_ESP32

/**
 * @brief String used for version numbers when the value is not available.
 */
#define UNKNOWN_VERSION_STRING              "Not available"

/****************************************************************************
 * Local type defintions.
 ****************************************************************************/

/****************************************************************************
 * Private Data
 ****************************************************************************/

/**
 *  Local variable to hold a pointer to the configuration.
 */
static meadow_configuration_t *meadow_configuration = NULL;

/**
 *  @brief Array of network interfaces available.
 */
static meadow_network_interface_t network_interfaces[] = 
{
    {
        .interface_type = MEADOW_IFT_ESP32,
        .name = MEADOW_IFT_ESP32_NAME,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0,
        .psock_methods = &g_usrsock_sockif_esp32
    },
    {
        .interface_type = MEADOW_IFT_ETHERNET,
        .name = MEADOW_IFT_ETHERNET_NAME,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0,
        .psock_methods = NULL
    },
    {
        .interface_type = MEADOW_IFT_CELL,
        .name = MEADOW_IFT_CELL_NAME,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0,
        .psock_methods = NULL
    }
};

/**
 *  Mutex to be used by any code that wants access to the configuration.
 */
static sem_t config_lock = { };

/**
 *  Structure to hold the F7MicroV2 pin mappings
 */
struct f7_micro_v2_pin_mapping_s {
    const char* pin_name;
    int pin_value;
};
typedef struct f7_micro_v2_pin_mapping_s f7_micro_v2_pin_mapping_t;

/**
 *  Define the pin mappings as an array of structures.
 */
const f7_micro_v2_pin_mapping_t f7_micro_v2_pin_mappings[] = {
    { F7_MICRO_V2_A4_PIN_NAME, F7_MICRO_V2_A4_PIN },
    { F7_MICRO_V2_A5_PIN_NAME, F7_MICRO_V2_A5_PIN },
    { F7_MICRO_V2_A3_PIN_NAME, F7_MICRO_V2_A3_PIN },
    { F7_MICRO_V2_B0_PIN_NAME, F7_MICRO_V2_B0_PIN },
    { F7_MICRO_V2_B1_PIN_NAME, F7_MICRO_V2_B1_PIN },
    { F7_MICRO_V2_C0_PIN_NAME, F7_MICRO_V2_C0_PIN },
    { F7_MICRO_V2_I9_PIN_NAME, F7_MICRO_V2_I9_PIN },
    { F7_MICRO_V2_H13_PIN_NAME, F7_MICRO_V2_H13_PIN },
    { F7_MICRO_V2_H10_PIN_NAME, F7_MICRO_V2_H10_PIN },
    { F7_MICRO_V2_B8_PIN_NAME, F7_MICRO_V2_B8_PIN },
    { F7_MICRO_V2_B9_PIN_NAME, F7_MICRO_V2_B9_PIN },
    { F7_MICRO_V2_B4_PIN_NAME, F7_MICRO_V2_B4_PIN },
    { F7_MICRO_V2_B13_PIN_NAME, F7_MICRO_V2_B13_PIN },
    { F7_MICRO_V2_B7_PIN_NAME, F7_MICRO_V2_B7_PIN },
    { F7_MICRO_V2_B6_PIN_NAME, F7_MICRO_V2_B6_PIN },
    { F7_MICRO_V2_C6_PIN_NAME, F7_MICRO_V2_C6_PIN },
    { F7_MICRO_V2_C7_PIN_NAME, F7_MICRO_V2_C7_PIN },
    { F7_MICRO_V2_C9_PIN_NAME, F7_MICRO_V2_C9_PIN },
    { F7_MICRO_V2_B14_PIN_NAME, F7_MICRO_V2_B14_PIN },
    { F7_MICRO_V2_B15_PIN_NAME, F7_MICRO_V2_B15_PIN },
    { F7_MICRO_V2_B12_PIN_NAME, F7_MICRO_V2_B12_PIN },
    { F7_MICRO_V2_G12_PIN_NAME, F7_MICRO_V2_G12_PIN },
};

struct meadow_uart_mapping_s  
{
    const char *tty_name;
    const char *com_name;
};

const struct meadow_uart_mapping_s hcom_nx_uart_mapping [] =
{
    { MEADOW_UART1_NAME, MEADOW_COM1_NAME},
    { MEADOW_UART4_NAME, MEADOW_COM4_NAME},
    { MEADOW_UART6_NAME, MEADOW_COM6_NAME},
}; 

/**
 * @brief Names of the valid ESP log destinations. 
 */
meadow_log_destinations_t valid_esp_log_destinations[] =
{
    { "jtag", esp_log_destination_jtag },
    { "udp", esp_log_destination_udp },
    { "uart", esp_log_destination_uart },
};

/**
 * @brief Valid components that can generate generate log information.
 */
static char *esp_log_component_names[] = {
    "wifi",
    "system",
    "bluetooth",
    "thread",
    "spi",
    "messages"
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: hcom_nx_config_populate_cell_module_id
 *
 * Description:
 *  Populate the cell module id according to the cell module name set in
 *  the cell.config.yaml
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_populate_cell_module_id(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL) || (config->default_cell_settings->module == NULL))
    {
        syslog(LOG_INFO, "Failed getting cell default settings");
        return;
    }

    if (strcasecmp(config->default_cell_settings->module, CELL_BG770A_MODULE_NAME) == 0)
    {
        config->default_cell_settings->module_id = CELL_BG770A_MODULE;
    }
    else if (strcasecmp(config->default_cell_settings->module, CELL_M95_MODULE_NAME) == 0)
    {
        config->default_cell_settings->module_id = CELL_M95_MODULE;
    }
    else if (strcasecmp(config->default_cell_settings->module, CELL_BG95M3_MODULE_NAME) == 0)
    {
        config->default_cell_settings->module_id = CELL_BG95M3_MODULE;
    }
    else
    {
        syslog(LOG_INFO, "Failed populating cell module id");
        config->default_cell_settings->module_id = CELL_UNKNOWN_MODULE;
    }
}

/****************************************************************************
 * Name: hcom_nx_config_populate_cell_network_mode_id
 *
 * Description:
 *  Populate the cell network mode id according to the mode set
 *  in the cell.config.yaml
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_populate_cell_network_mode_id(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL) || (config->default_cell_settings->mode == NULL))
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    if (strcasecmp(config->default_cell_settings->mode, CELL_CATM1_MODE_NAME) == 0)
    {
        config->default_cell_settings->mode_id = CELL_CATM1_MODE;
    }
    else if (strcasecmp(config->default_cell_settings->mode, CELL_NBIOT_MODE_NAME) == 0)
    {
        config->default_cell_settings->mode_id = CELL_NBIOT_MODE;
    }
    else if (strcasecmp(config->default_cell_settings->mode, CELL_GSM_MODE_NAME) == 0)
    {
        config->default_cell_settings->mode_id = CELL_GSM_MODE;
    }
    else
    {
        syslog(LOG_INFO, "Failed populating cell network mode id");
        config->default_cell_settings->mode_id = CELL_UNKNOWN_MODE;
    }
}

/****************************************************************************
 * Name: hcom_nx_config_map_cell_network_mode
 *
 * Description:
 *  Map the cell network mode according to the Mode defined in
 *  the cell.config.yaml, since different modules may use distinct integers 
 *  to reference network modes (e.g., Cat-M1 is 8 for Quectel BG95-M3, 
 *  but 7 for Quectel BG770A).
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_map_cell_network_mode(meadow_configuration_t *config)
{
    if ((config == NULL) || (config->default_cell_settings == NULL))
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    uint32_t module = config->default_cell_settings->module_id;
    uint32_t mode = config->default_cell_settings->mode_id;

