WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    for (int index = 0; index < server_count; index++)
    {
        config->dns_servers[index] = kmm_strdup(servers[index]);
        if (config->dns_servers[index] == NULL)
        {
            perror("Memory allocation error");
            return;
        }
        config->dns_servers_count++;
    }
}

/****************************************************************************
 * Name: hcom_nx_config_create_dns_resolver_file
 *
 * Description:
 *  Create the DNS resolver file populated with the servers (where valid)
 *  specified.
 *
 * Input Parameters:
 *  servers - pointer to a list of DNS server IP addresses.
 *  server_count - number of servers in the list.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static void hcom_nx_config_create_dns_resolver_file(const char **servers, uint32_t server_count)
{
    FILE *dns_file = fopen(CONFIG_NETDB_RESOLVCONF_PATH, "wb");
    for (int index = 0; index < server_count; index++)
    {
        if (hcom_nx_config_is_valid_ip_address(servers[index]))
        {
            fputs("nameserver ", dns_file);
            fputs(servers[index], dns_file);
            fputs("\n", dns_file);
        }
    }
    fclose(dns_file);
}

/****************************************************************************
 * Name: hcom_nx_config_setup_default_dns_servers
 *
 * Description:
 *  Create the DNS resolver file with a default DNS server entry.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_setup_default_dns_servers(void)
{
    char *servers = DNS_DEFAULT_SERVER;
    hcom_nx_config_create_dns_resolver_file((const char **) &servers, 1);
}

/****************************************************************************
 * Name: hcom_nx_config_get_file_content
 *
 * Description:
 * Extract the data inside the current file.
 *
 * Input Parameters:
 *  path - pointer to file pathname.
 *
 * Returned Value:
 *  Pointer containing the file data, otherwise NULL.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static char *hcom_nx_config_get_file_content(char *path)
{
    long int file_size = 0;
    char *buffer = NULL;

    if (path != NULL)
    {
        FILE * file = fopen(path, "r");
        if (file != NULL)
        {
            fseek(file, 0L, SEEK_END);
            file_size = ftell(file);

            buffer = (char *) zalloc(file_size + 1);
            if (buffer != NULL)
            {
                fseek(file, 0, SEEK_SET);
                fread(buffer, 1, file_size, file);
            }
            fclose(file);
        }
    }
    return buffer;
}

/****************************************************************************
 * Name: hcom_nx_config_set_file
 *
 * Description:
 *  Overwrite the content to new one.
 *
 * Input Parameters:
 *  path   - pointer to file pathname.
 *  buffer - Buffer holding the new content
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_file(char *path, char *buffer)
{
    if (path != NULL && buffer != NULL)
    {
        FILE *file = fopen(path, "w");
        if (file != NULL)
        {
            fputs(buffer, file);
            fclose(file);
            return OK;
        }
    }
    return ERROR;
}

/****************************************************************************
 * Name: hcom_nx_config_update_dns_file
 *
 * Description:
 * Update the DNS file with the new nameserver, moving to the top of the file.
 *
 * Input Parameters:
 *  path - pointer to file pathname.
 *  server - pointer to a server.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_update_dns_file(char *path, char* server)
{
    char *buffer = hcom_nx_config_get_file_content(path);
    int result = 0;
    int ret = ERROR;

    if (buffer != NULL)
    {
        if (server != NULL)
        {
            result = strlen(buffer) + strlen(server) + 13;
            char *new_content = (char *) zalloc(result + 1);
            if (new_content != NULL)
            {
                snprintf(new_content, result, "nameserver %s\n%s", server, buffer);
                ret = hcom_nx_config_set_file(path, new_content);
                free(new_content);
            }
        }
        free(buffer);
    }
    return ret;
}

/****************************************************************************
 * Name: hcom_nx_config_add_default_gateway_dns_file
 *
 * Description:
 *  Add the default gateway into DNS resolver file.
 *
 * Input Parameters:
 *  config - config - pointer to the configuration object.
 *  gateway - default gateway address.
 * 
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
void hcom_nx_config_add_default_gateway_dns_file(meadow_configuration_t *config, uint32_t gateway)
{
    if (config != NULL)
    {
        if (config->default_interface->gateway_changed == false)
        {
            if (gateway != 0)
            {
                struct sockaddr_in addr = { };
                addr.sin_family = AF_INET;
                addr.sin_port = 0;

                memcpy(&addr.sin_addr, &gateway, sizeof(struct in_addr));

                char *gateway_addr = inet_ntoa(addr.sin_addr);

                if (hcom_nx_config_update_dns_file(CONFIG_NETDB_RESOLVCONF_PATH, gateway_addr) < 0)
                {
                    syslog(LOG_ERR, "Failed to add default gateway\n");
                    return; 
                }
                syslog(LOG_INFO, "Successful to add default gateway\n");
                config->default_interface->gateway_changed = true;
            }
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_config_find_interface_by_name
 *
 * Description:
 *  Find the specified interface in the list of registered (possible) interfaces.
 *
 * Input Parameters:
 *  name - Name of the interface to find.
 *
 * Returned Value:
 *  Pointer to the interface requested, NULL if the interface cannot be found.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static meadow_network_interface_t *hcom_nx_config_find_interface_by_name(const char *name)
{
    meadow_network_interface_t *interface = NULL;
    if (name != NULL)
    {
        for (int index = 0; index < sizeof(network_interfaces) / sizeof(meadow_network_interface_t); index++)
        {
            if (strcasecmp(network_interfaces[index].name, name) == 0)
            {
                interface = &network_interfaces[index];
                break;
            }
        }
    }
    return(interface);
}

/****************************************************************************
 * Name: hcom_nx_config_process_interface_section
 *
 * Description:
 *  Process a network interface definition from the meadow.config.yaml file.
 *
 * Input Parameters:
 *  yaml_interface - Pointer to information about a network interface.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_process_interface_section(yaml_network_interface_t *yaml_interface)
{
    if (yaml_interface != NULL)
    {
        meadow_network_interface_t *interface = hcom_nx_config_find_interface_by_name(yaml_interface->name);
        if (interface != NULL)
        {
            interface->ip_address = hcom_nx_config_parse_ip_address(yaml_interface->ip_address);
            interface->netmask = hcom_nx_config_parse_ip_address(yaml_interface->netmask);
            interface->gateway = hcom_nx_config_parse_ip_address(yaml_interface->gateway);
            interface->use_dhcp = hcom_nx_config_parse_boolean(yaml_interface->use_dhcp, 1);
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_config_process_network_section
 *
 * Description:
 *  Process the network section from the meadow.config.yaml file.
 *
 * Input Parameters:
 *  network_config - Pointer the to yaml_network_t object containing the
 *                   network configuration from the config file.
 *  meadow_configuration - Pointer to the configuration information being
 *                         assembled from the config file.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_process_network_section(yaml_network_t *network_config, meadow_configuration_t *config)
{
    if (network_config != NULL)
    {
        config->get_network_time_at_startup = hcom_nx_config_parse_boolean(network_config->get_network_time_at_startup, 0);
        if (network_config->ntp_servers_count > 0)
        {
            config->ntp_servers_count = network_config->ntp_servers_count;
            config->ntp_servers = kmm_zalloc(meadow_configuration->ntp_servers_count * sizeof(char *));
            for (int index = 0; index < meadow_configuration->ntp_servers_count; index++)
            {
                config->ntp_servers[index] = kmm_strdup(network_config->ntp_servers[index]);
            }
        }
        else
        {
            hcom_nx_config_setup_default_ntp_servers(meadow_configuration);
        }
        config->ntp_refresh_period_seconds = hcom_nx_config_parse_unsigned_integer(network_config->ntp_refresh_period_seconds, NTP_DEFAULT_REFRESH_PERIOD);
        if (config->ntp_refresh_period_seconds < NTP_MINIMUM_REFRESH_PERIOD)
        {
            config->ntp_refresh_period_seconds = NTP_MINIMUM_REFRESH_PERIOD;
        }
        hcom_nx_config_setup_dns_servers(config, network_config->dns_servers, network_config->dns_servers_count);
        bool create_default_dns_resolver_file = true;
        if (network_config->dns_servers_count > 0)
        {
            for (int index = 0; index < network_config->dns_servers_count; index++)
            {
                if (hcom_nx_config_is_valid_ip_address(network_config->dns_servers[index]))
                {
                    create_default_dns_resolver_file = false;
                    break;
                }
            }
        }
        if (create_default_dns_resolver_file)
        {
            hcom_nx_config_setup_default_dns_servers();
        }
        else
        {
            hcom_nx_config_create_dns_resolver_file(network_config->dns_servers, network_config->dns_servers_count);
        }
        //
        //  Now work out the network interface / adapter details.
        //
        if ((network_config->interfaces != NULL) && (network_config->interfaces_count > 0))
        {
            for (int index = 0; index < network_config->interfaces_count; index++)
            {
                hcom_nx_config_process_interface_section(&network_config->interfaces[index]);
            }
        }
        //
        //  Now work out which adapter should be used.
        //
        config->default_interface = hcom_nx_config_find_interface_by_name(network_config->default_interface);
        if (config->default_interface == NULL)
        {
            config->default_interface = hcom_nx_config_find_interface_by_name(MEADOW_IFT_ESP32_NAME);
        }
        config->default_interface->gateway_changed = false;
    }
    else
    {
        hcom_nx_config_setup_default_ntp_servers(config);
        hcom_nx_config_setup_default_dns_servers();
        config->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
    }
}

/****************************************************************************
 * Name: hcom_nx_config_esp_log_destination
 *
 * Description:
 *  Parse the list of destinations for the ESP log data.
 * 
 *  An invalid destination string will raise an invalid configuration file
 *  exception to managed code.
 *
 * Input Parameters:
 *  destination - string holding the destination name.
 *
 * Returned Value:
 *  esp_log_destination_t destination type.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static esp_log_destination_t hcom_nx_config_esp_log_destination(char const *destination)
{
    if (destination != NULL)
    {
        for (int index = 0; index < sizeof(valid_esp_log_destinations) / sizeof(esp_log_destination_t); index++)
        {
            int length = strlen(valid_esp_log_destinations[index].name);
            if ((strnlen(destination, length + 1) == length) && (strcasecmp(destination, valid_esp_log_destinations[index].name) == 0))
            {
                return(valid_esp_log_destinations[index].destination);
            }
        }
        //
        //  If we get here then the destination string is not one of the valid destinations.
        //  Log the issue, raise an exception and return the default destination of None.
        //
        meadow_logging_write(mfl_error, "Error unknown ESP log destination.");
        meadow_os_raise_simple_exception(espcp_status_codes_invalid_configuration_file);
    }
    return(esp_log_destination_none);
}

/****************************************************************************
 * Name: hcom_nx_validate_esp_log_components
 *
 * Description:
 *  Parse the list of components that can generate logging information and
 *  compare against the list of acceptable components.
 * 
 * Input Parameters:
 *  components - semi-colon separated list of components.
 *
 * Returned Value:
 *  NULL if the list contains one or more invalid entries, pointer to the
 *  components string if all entries are valid.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static char *hcom_nx_validate_esp_log_components(char *components)
{
    if (components != NULL)
    {
        char *residual;
        char *duplicate = kmm_strdup(components);
        char *component = strtok_r(duplicate, ";", &residual);
        while (component != NULL)
        {
            bool found = false;
            for (int index = 0; index < sizeof(esp_log_component_names) / sizeof(char *); index++)
            {
                int length = strlen(esp_log_component_names[index]);
                if ((strnlen(component, length + 1) == length) && (strcasecmp(component, esp_log_component_names[index]) == 0))
                {
                    found = true;
                    break;
                }
            }
            if (!found)
            {
                kmm_free(duplicate);
                return(NULL);
            }
            component = strtok_r(residual, ";", &residual);
        }
        kmm_free(duplicate);
    }
    return(components);
}

/****************************************************************************
 * Name: hcom_nx_config_process_meadow_config_file
 *
 * Description:
 *  Read the current configuration from flash and populate the configuration
 *  object.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *  Pointer to the newly populated configuration object or NULL if there was
 *  a problem.
 *
 * Assumptions/Limitations:
 *  This method is only allowed to be called once to read the configuration
 *  at startup.  Duplicate calls to this method simply return the current
 *  value of the meadow_configuration pointer and take no other action.
 *
 ****************************************************************************/
static meadow_configuration_t *hcom_nx_config_process_meadow_config_file(void)
{
    hcom_nx_config_lock();
    if (meadow_configuration == NULL)
    {
        meadow_configuration = (meadow_configuration_t *) kmm_zalloc(sizeof(meadow_configuration_t));
        if (meadow_configuration != NULL)
        {
        	yaml_configuration_t *configuration;

            cyaml_err_t err = cyaml_load_file(MEADOW_CONFIG_DEFAULT_FILE_NAME, &cyaml_config, &configuration_schema, (void **) &configuration, NULL);
            if ((err != CYAML_OK) || (configuration == NULL))
            {
                if (err != CYAML_OK)
                {
                    meadow_logging_write(mfl_error, "Error processing config file, using default config");
                    meadow_os_raise_simple_exception(espcp_status_codes_invalid_configuration_file);
                }
                //
                //  Add any default settings here.
                //
                meadow_configuration->using_default_configuration = 1;
                meadow_configuration->reboot_on_unhandled_exceptions = 1;
                meadow_configuration->initialisation_timeout_seconds = DEFAULT_INITIALISATION_TIMEOUT_SECONDS;
                meadow_configuration->reset_esp32_at_startup = 1;
                meadow_configuration->esp_spi_speed_hz = DEFAULT_STM_ESP_SPI_SPEED;
                meadow_configuration->maximum_retry_count = 3;
                hcom_nx_config_setup_default_dns_servers();                
                hcom_nx_config_setup_default_ntp_servers(meadow_configuration);
                meadow_configuration->ntp_refresh_period_seconds = NTP_DEFAULT_REFRESH_PERIOD;
                meadow_configuration->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
            }
            else
            {
                meadow_configuration->using_default_configuration = 0;
                if (configuration->mono_control != NULL)
                {
                    meadow_configuration->mono_options = kmm_strdup(configuration->mono_control->options);
                }
                //
                if (configuration->coprocessor != NULL)
                {
                    uint32_t speed = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->spi_speed_hz, DEFAULT_STM_ESP_SPI_SPEED);
                    meadow_configuration->esp_spi_speed_hz = (speed < 100000) ? 100000 : speed;
                    meadow_configuration->automatically_reconnect = hcom_nx_config_parse_boolean(configuration->coprocessor->automatically_reconnect, false);
                    meadow_configuration->automatically_start_network = hcom_nx_config_parse_boolean(configuration->coprocessor->automatically_start_network, false);
                    meadow_configuration->maximum_retry_count = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->maximum_retry_count, 3);
                    meadow_configuration->log_destination = hcom_nx_config_esp_log_destination(configuration->coprocessor->log_destination);
                    // meadow_configuration->log_components = kmm_strdup(configuration->coprocessor->log_components);
                    if (configuration->coprocessor->log_components != NULL)
                    {
                        if (hcom_nx_validate_esp_log_components(configuration->coprocessor->log_components) == NULL)
                        {
                            meadow_configuration->log_components = NULL;
                            meadow_logging_write(mfl_error, "Error unknown ESP log component.");
                            meadow_os_raise_simple_exception(espcp_status_codes_invalid_configuration_file);
                        }
                        else
                        {
                            meadow_configuration->log_components = kmm_strdup(configuration->coprocessor->log_components);
                        }
                    }
                    meadow_configuration->log_udp_port = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->log_udp_port, 30000);
                }
                else
                {
                    meadow_configuration->esp_spi_speed_hz = DEFAULT_STM_ESP_SPI_SPEED;
                    meadow_configuration->log_destination = esp_log_destination_none;
                }
                hcom_nx_config_process_network_section(configuration->network, meadow_configuration);
                if (configuration->internal_debug != NULL)
                {
                    meadow_configuration->trace_level = hcom_nx_config_parse_unsigned_integer(configuration->internal_debug->trace_level, 0);
                    if (meadow_configuration->trace_level > 4)
                    {
                        meadow_configuration->trace_level = 0;
                    }
                    meadow_configuration->use_uart1_for_trace = (strcmp(configuration->internal_debug->uart1_use, "trace") == 0);
                    meadow_configuration->use_uart1_for_profiling = (strcmp(configuration->internal_debug->uart1_use, "profiler") == 0);
                    meadow_configuration->reset_esp32_at_startup = !hcom_nx_config_parse_boolean(configuration->internal_debug->debugger_attached_to_esp, false);
                }
                else
                {
                    meadow_configuration->reset_esp32_at_startup = 1;
                }
                //
                if (configuration->device != NULL)
                {
                    if (configuration->device->name == NULL)
                    {
                        meadow_configuration->device_name = kmm_strdup(MEADOW_CONFIG_DEFAULT_DEVICE_NAME);
                    }
                    else
                    {
                        meadow_configuration->device_name = kmm_strdup(configuration->device->name);
                    }
                    if (configuration->device->reserved_pins != NULL)
                    {
                        meadow_configuration->reserved_pins = kmm_strdup(configuration->device->reserved_pins);
                    }
                    meadow_configuration->reboot_on_unhandled_exceptions = hcom_nx_config_parse_boolean(configuration->device->reboot_on_unhandled_exceptions, true);
                    meadow_configuration->initialisation_timeout_seconds = hcom_nx_config_parse_unsigned_integer(configuration->device->initialisation_timeout_seconds, DEFAULT_INITIALISATION_TIMEOUT_SECONDS);
                    meadow_configuration->sd_storage_supported = hcom_nx_config_parse_boolean(configuration->device->sd_storage_supported, false)
                                                                 && (meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_CCMV2);
                }

                cyaml_free(&cyaml_config, &configuration_schema, configuration, 0);
                meadow_logging_write(mfl_info, "Config file successfully processed");
            }
        }
    }
    hcom_nx_config_unlock();

